[
  {"id":"alam_novel_2011","abstract":"Keratins are cytoplasmic intermediate filament proteins preferentially expressed by epithelial tissues in a site-specific and differentiation-dependent manner. The complex network of keratin filaments in stratified epithelia is tightly regulated during squamous cell differentiation. Keratin 14 (K14) is expressed in mitotically active basal layer cells, along with its partner keratin 5 (K5), and their expression is down-regulated as cells differentiate. Apart from the cytoprotective functions of K14, very little is known about K14 regulatory functions, since the K14 knockout mice show postnatal lethality. In this study, K14 expression was inhibited using RNA interference in cell lines derived from stratified epithelia to study the K14 functions in epithelial homeostasis. The K14 knockdown clones demonstrated substantial decreases in the levels of the K14 partner K5. These cells showed reduction in cell proliferation and delay in cell cycle progression, along with decreased phosphorylated Akt levels. K14 knockdown cells also exhibited enhanced levels of activated Notch1, involucrin, and K1. In addition, K14 knockdown AW13516 cells showed significant reduction in tumorigenicity. Our results suggest that K5 and K14 may have a role in maintenance of cell proliferation potential in the basal layer of stratified epithelia, modulating phosphatidylinositol 3-kinase/Akt-mediated cell proliferation and/or Notch1-dependent cell differentiation.","author":[{"family":"Alam","given":"Hunain"},{"family":"Sehgal","given":"Lalit"},{"family":"Kundu","given":"Samrat T."},{"family":"Dalal","given":"Sorab N."},{"family":"Vaidya","given":"Milind M."}],"container-title":"Molecular Biology of the Cell","container-title-short":"Mol Biol Cell","DOI":"10.1091/mbc.E10-08-0703","ISSN":"1939-4586","issue":"21","issued":{"date-parts":[[2011,11]]},"language":"eng","page":"4068-4078","PMCID":"PMC3204069","PMID":"21900500","source":"PubMed","title":"Novel function of keratins 5 and 14 in proliferation and differentiation of stratified epithelial cells","type":"article-journal","volume":"22"},
  {"id":"bartosovic_single-cell_2021","abstract":"In contrast to single-cell approaches for measuring gene expression and DNA accessibility, single-cell methods for analyzing histone modifications are limited by low sensitivity and throughput. Here, we combine the CUT&Tag technology, developed to measure bulk histone modifications, with droplet-based single-cell library preparation to produce high-quality single-cell data on chromatin modifications. We apply single-cell CUT&Tag (scCUT&Tag) to tens of thousands of cells of the mouse central nervous system and probe histone modifications characteristic of active promoters, enhancers and gene bodies (H3K4me3, H3K27ac and H3K36me3) and inactive regions (H3K27me3). These scCUT&Tag profiles were sufficient to determine cell identity and deconvolute regulatory principles such as promoter bivalency, spreading of H3K4me3 and promoter–enhancer connectivity. We also used scCUT&Tag to investigate the single-cell chromatin occupancy of transcription factor OLIG2 and the cohesin complex component RAD21. Our results indicate that analysis of histone modifications and transcription factor occupancy at single-cell resolution provides unique insights into epigenomic landscapes in the central nervous system.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Bartosovic","given":"Marek"},{"family":"Kabbe","given":"Mukund"},{"family":"Castelo-Branco","given":"Gonçalo"}],"container-title":"Nature Biotechnology","DOI":"10.1038/s41587-021-00869-9","ISSN":"1546-1696","issued":{"date-parts":[[2021,4,12]]},"language":"en","page":"1-11","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Single-cell CUT&Tag profiles histone modifications and transcription factors in complex tissues","type":"article-journal","URL":"https://www.nature.com/articles/s41587-021-00869-9"},
  {"id":"bingham_pyro_2019","abstract":"Pyro is a probabilistic programming language built on Python as a platform for developing advanced probabilistic models in AI research. To scale to large data sets and high-dimensional models, Pyro uses stochastic variational inference algorithms and probability distributions built on top of PyTorch, a modern GPU-accelerated deep learning framework. To accommodate complex or model-specific algorithmic behavior, Pyro leverages Poutine, a library of composable building blocks for modifying the behavior of probabilistic programs.","author":[{"family":"Bingham","given":"Eli"},{"family":"Chen","given":"Jonathan P."},{"family":"Jankowiak","given":"Martin"},{"family":"Obermeyer","given":"Fritz"},{"family":"Pradhan","given":"Neeraj"},{"family":"Karaletsos","given":"Theofanis"},{"family":"Singh","given":"Rohit"},{"family":"Szerlip","given":"Paul"},{"family":"Horsfall","given":"Paul"},{"family":"Goodman","given":"Noah D."}],"container-title":"The Journal of Machine Learning Research","container-title-short":"J. Mach. Learn. Res.","ISSN":"1532-4435","issue":"1","issued":{"date-parts":[[2019,1,1]]},"page":"973–978","source":"January 2019","title":"Pyro: deep universal probabilistic programming","title-short":"Pyro","type":"article-journal","volume":"20"},
  {"id":"blei_variational_2017","abstract":"One of the core problems of modern statistics is to approximate difficult-to-compute probability densities. This problem is especially important in Bayesian statistics, which frames all inference about unknown quantities as a calculation involving the posterior density. In this paper, we review variational inference (VI), a method from machine learning that approximates probability densities through optimization. VI has been used in many applications and tends to be faster than classical methods, such as Markov chain Monte Carlo sampling. The idea behind VI is to first posit a family of densities and then to find the member of that family which is close to the target. Closeness is measured by Kullback-Leibler divergence. We review the ideas behind mean-field variational inference, discuss the special case of VI applied to exponential family models, present a full example with a Bayesian mixture of Gaussians, and derive a variant that uses stochastic optimization to scale up to massive data. We discuss modern research in VI and highlight important open problems. VI is powerful, but it is not yet well understood. Our hope in writing this paper is to catalyze statistical research on this class of algorithms.","accessed":{"date-parts":[[2021,4,21]]},"author":[{"family":"Blei","given":"David M."},{"family":"Kucukelbir","given":"Alp"},{"family":"McAuliffe","given":"Jon D."}],"container-title":"Journal of the American Statistical Association","container-title-short":"Journal of the American Statistical Association","DOI":"10.1080/01621459.2017.1285773","ISSN":"0162-1459, 1537-274X","issue":"518","issued":{"date-parts":[[2017,4,3]]},"page":"859-877","source":"arXiv.org","title":"Variational Inference: A Review for Statisticians","title-short":"Variational Inference","type":"article-journal","URL":"http://arxiv.org/abs/1601.00670","volume":"112"},
  {"id":"cable_robust_2021","abstract":"A limitation of spatial transcriptomics technologies is that individual measurements may contain contributions from multiple cells, hindering the discovery of cell-type-specific spatial patterns of localization and expression. Here, we develop robust cell type decomposition (RCTD), a computational method that leverages cell type profiles learned from single-cell RNA-seq to decompose cell type mixtures while correcting for differences across sequencing technologies. We demonstrate the ability of RCTD to detect mixtures and identify cell types on simulated datasets. Furthermore, RCTD accurately reproduces known cell type and subtype localization patterns in Slide-seq and Visium datasets of the mouse brain. Finally, we show how RCTD’s recovery of cell type localization enables the discovery of genes within a cell type whose expression depends on spatial environment. Spatial mapping of cell types with RCTD enables the spatial components of cellular identity to be defined, uncovering new principles of cellular organization in biological tissue. RCTD is publicly available as an open-source R package at https://github.com/dmcable/RCTD.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Cable","given":"Dylan M."},{"family":"Murray","given":"Evan"},{"family":"Zou","given":"Luli S."},{"family":"Goeva","given":"Aleksandrina"},{"family":"Macosko","given":"Evan Z."},{"family":"Chen","given":"Fei"},{"family":"Irizarry","given":"Rafael A."}],"container-title":"Nature Biotechnology","DOI":"10.1038/s41587-021-00830-w","ISSN":"1546-1696","issued":{"date-parts":[[2021,2,18]]},"language":"en","page":"1-10","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Robust decomposition of cell type mixtures in spatial transcriptomics","type":"article-journal","URL":"https://www.nature.com/articles/s41587-021-00830-w"},
  {"id":"consortium_gtex_2020","abstract":"A survey of transcription across tissues\nSome human genetic variants affect the amount of RNA produced and the splicing of gene transcripts, crucial steps in development and maintaining a healthy individual. However, some of these changes only occur in a small number of tissues within the body. The Genotype-Tissue Expression (GTEx) project has been expanded over time, and, looking at the final data in version 8, Aguet et al. present a deep characterization of genetic associations and gene expression and splicing in 838 individuals over 49 tissues (see the Perspective by Wilson). This large study was able to characterize the details underlying many aspects of gene expression and provides a resource with which to better understand the fundamental molecular mechanisms of how genetic variants affect gene regulation and complex traits in humans.\nScience, this issue p. 1318; see also p. 1298\nThe Genotype-Tissue Expression (GTEx) project was established to characterize genetic effects on the transcriptome across human tissues and to link these regulatory mechanisms to trait and disease associations. Here, we present analyses of the version 8 data, examining 15,201 RNA-sequencing samples from 49 tissues of 838 postmortem donors. We comprehensively characterize genetic associations for gene expression and splicing in cis and trans, showing that regulatory associations are found for almost all genes, and describe the underlying molecular mechanisms and their contribution to allelic heterogeneity and pleiotropy of complex traits. Leveraging the large diversity of tissues, we provide insights into the tissue specificity of genetic effects and show that cell type composition is a key factor in understanding gene regulatory mechanisms in human tissues.\nThe Genotype-Tissue Expression (GTEx) project dissects how genetic variation affects gene expression and splicing.\nThe Genotype-Tissue Expression (GTEx) project dissects how genetic variation affects gene expression and splicing.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Consortium","given":"The GTEx"}],"container-title":"Science","DOI":"10.1126/science.aaz1776","ISSN":"0036-8075, 1095-9203","issue":"6509","issued":{"date-parts":[[2020,9,11]]},"language":"en","page":"1318-1330","PMID":"32913098","publisher":"American Association for the Advancement of Science","section":"Research Article","source":"science.sciencemag.org","title":"The GTEx Consortium atlas of genetic regulatory effects across human tissues","type":"article-journal","URL":"https://science.sciencemag.org/content/369/6509/1318","volume":"369"},
  {"id":"crowell_muscat_2020","abstract":"Single-cell RNA sequencing (scRNA-seq) has become an empowering technology to profile the transcriptomes of individual cells on a large scale. Early analyses of differential expression have aimed at identifying differences between subpopulations to identify subpopulation markers. More generally, such methods compare expression levels across sets of cells, thus leading to cross-condition analyses. Given the emergence of replicated multi-condition scRNA-seq datasets, an area of increasing focus is making sample-level inferences, termed here as differential state analysis; however, it is not clear which statistical framework best handles this situation. Here, we surveyed methods to perform cross-condition differential state analyses, including cell-level mixed models and methods based on aggregated pseudobulk data. To evaluate method performance, we developed a flexible simulation that mimics multi-sample scRNA-seq data. We analyzed scRNA-seq data from mouse cortex cells to uncover subpopulation-specific responses to lipopolysaccharide treatment, and provide robust tools for multi-condition analysis within the muscat R package.","accessed":{"date-parts":[[2021,4,30]]},"author":[{"family":"Crowell","given":"Helena L."},{"family":"Soneson","given":"Charlotte"},{"family":"Germain","given":"Pierre-Luc"},{"family":"Calini","given":"Daniela"},{"family":"Collin","given":"Ludovic"},{"family":"Raposo","given":"Catarina"},{"family":"Malhotra","given":"Dheeraj"},{"family":"Robinson","given":"Mark D."}],"container-title":"Nature Communications","DOI":"10.1038/s41467-020-19894-4","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[[2020,11,30]]},"language":"en","number":"1","page":"6077","publisher":"Nature Publishing Group","source":"www.nature.com","title":"muscat detects subpopulation-specific state transitions from multi-sample multi-condition single-cell transcriptomics data","type":"article-journal","URL":"https://www.nature.com/articles/s41467-020-19894-4","volume":"11"},
  {"id":"demaree_joint_2021","abstract":"Studies of acute myeloid leukemia rely on DNA sequencing and immunophenotyping by flow cytometry as primary tools for disease characterization. However, leukemia tumor heterogeneity complicates integration of DNA variants and immunophenotypes from separate measurements. Here we introduce DAb-seq, a technology for simultaneous capture of DNA genotype and cell surface phenotype from single cells at high throughput, enabling direct profiling of proteogenomic states in tens of thousands of cells. To demonstrate the approach, we analyze the disease of three patients with leukemia over multiple treatment timepoints and disease recurrences. We observe complex genotype-phenotype dynamics that illustrate the subtlety of the disease process and the degree of incongruity between blast cell genotype and phenotype in different clinical scenarios. Our results highlight the importance of combined single-cell DNA and protein measurements to fully characterize the heterogeneity of leukemia.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Demaree","given":"Benjamin"},{"family":"Delley","given":"Cyrille L."},{"family":"Vasudevan","given":"Harish N."},{"family":"Peretz","given":"Cheryl A. C."},{"family":"Ruff","given":"David"},{"family":"Smith","given":"Catherine C."},{"family":"Abate","given":"Adam R."}],"container-title":"Nature Communications","DOI":"10.1038/s41467-021-21810-3","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[[2021,3,11]]},"language":"en","number":"1","page":"1583","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Joint profiling of DNA and proteins in single cells to dissect genotype-phenotype associations in leukemia","type":"article-journal","URL":"https://www.nature.com/articles/s41467-021-21810-3","volume":"12"},
  {"id":"dixit_perturb-seq_2016","abstract":"Genetic screens help infer gene function in mammalian cells, but it has remained difficult to assay complex phenotypes—such as transcriptional profiles—at scale. Here, we develop Perturb-seq, combining single-cell RNA sequencing (RNA-seq) and clustered regularly interspaced short palindromic repeats (CRISPR)-based perturbations to perform many such assays in a pool. We demonstrate Perturb-seq by analyzing 200,000 cells in immune cells and cell lines, focusing on transcription factors regulating the response of dendritic cells to lipopolysaccharide (LPS). Perturb-seq accurately identifies individual gene targets, gene signatures, and cell states affected by individual perturbations and their genetic interactions. We posit new functions for regulators of differentiation, the anti-viral response, and mitochondrial function during immune activation. By decomposing many high content measurements into the effects of perturbations, their interactions, and diverse cell metadata, Perturb-seq dramatically increases the scope of pooled genomic assays.","accessed":{"date-parts":[[2021,3,25]]},"author":[{"family":"Dixit","given":"Atray"},{"family":"Parnas","given":"Oren"},{"family":"Li","given":"Biyu"},{"family":"Chen","given":"Jenny"},{"family":"Fulco","given":"Charles P."},{"family":"Jerby-Arnon","given":"Livnat"},{"family":"Marjanovic","given":"Nemanja D."},{"family":"Dionne","given":"Danielle"},{"family":"Burks","given":"Tyler"},{"family":"Raychowdhury","given":"Raktima"},{"family":"Adamson","given":"Britt"},{"family":"Norman","given":"Thomas M."},{"family":"Lander","given":"Eric S."},{"family":"Weissman","given":"Jonathan S."},{"family":"Friedman","given":"Nir"},{"family":"Regev","given":"Aviv"}],"container-title":"Cell","container-title-short":"Cell","DOI":"10.1016/j.cell.2016.11.038","ISSN":"0092-8674","issue":"7","issued":{"date-parts":[[2016,12,15]]},"language":"en","page":"1853-1866.e17","source":"ScienceDirect","title":"Perturb-Seq: Dissecting Molecular Circuits with Scalable Single-Cell RNA Profiling of Pooled Genetic Screens","title-short":"Perturb-Seq","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0092867416316105","volume":"167"},
  {"id":"elosua-bayes_spotlight_2021","abstract":"Spatially resolved gene expression profiles are key to understand tissue organization and function. However, spatial transcriptomics (ST) profiling techniques lack single-cell resolution and require a combination with single-cell RNA sequencing (scRNA-seq) information to deconvolute the spatially indexed datasets. Leveraging the strengths of both data types, we developed SPOTlight, a computational tool that enables the integration of ST with scRNA-seq data to infer the location of cell types and states within a complex tissue. SPOTlight is centered around a seeded non-negative matrix factorization (NMF) regression, initialized using cell-type marker genes and non-negative least squares (NNLS) to subsequently deconvolute ST capture locations (spots). Simulating varying reference quantities and qualities, we confirmed high prediction accuracy also with shallowly sequenced or small-sized scRNA-seq reference datasets. SPOTlight deconvolution of the mouse brain correctly mapped subtle neuronal cell states of the cortical layers and the defined architecture of the hippocampus. In human pancreatic cancer, we successfully segmented patient sections and further fine-mapped normal and neoplastic cell states. Trained on an external single-cell pancreatic tumor references, we further charted the localization of clinical-relevant and tumor-specific immune cell states, an illustrative example of its flexible application spectrum and future potential in digital pathology.","accessed":{"date-parts":[[2021,4,30]]},"author":[{"family":"Elosua-Bayes","given":"Marc"},{"family":"Nieto","given":"Paula"},{"family":"Mereu","given":"Elisabetta"},{"family":"Gut","given":"Ivo"},{"family":"Heyn","given":"Holger"}],"container-title":"Nucleic Acids Research","container-title-short":"Nucleic Acids Research","DOI":"10.1093/nar/gkab043","ISSN":"0305-1048","issue":"gkab043","issued":{"date-parts":[[2021,2,5]]},"source":"Silverchair","title":"SPOTlight: seeded NMF regression to deconvolute spatial transcriptomics spots with single-cell transcriptomes","title-short":"SPOTlight","type":"article-journal","URL":"https://doi.org/10.1093/nar/gkab043"},
  {"id":"eraslan_single-cell_2019","abstract":"Single-cell RNA sequencing (scRNA-seq) has enabled researchers to study gene expression at a cellular resolution. However, noise due to amplification and dropout may obstruct analyses, so scalable denoising methods for increasingly large but sparse scRNA-seq data are needed. We propose a deep count autoencoder network (DCA) to denoise scRNA-seq datasets. DCA takes the count distribution, overdispersion and sparsity of the data into account using a negative binomial noise model with or without zero-inflation, and nonlinear gene-gene dependencies are captured. Our method scales linearly with the number of cells and can, therefore, be applied to datasets of millions of cells. We demonstrate that DCA denoising improves a diverse set of typical scRNA-seq data analyses using simulated and real datasets. DCA outperforms existing methods for data imputation in quality and speed, enhancing biological discovery.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Eraslan","given":"Gökcen"},{"family":"Simon","given":"Lukas M."},{"family":"Mircea","given":"Maria"},{"family":"Mueller","given":"Nikola S."},{"family":"Theis","given":"Fabian J."}],"container-title":"Nature Communications","DOI":"10.1038/s41467-018-07931-2","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[[2019,1,23]]},"language":"en","number":"1","page":"390","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Single-cell RNA-seq denoising using a deep count autoencoder","type":"article-journal","URL":"https://www.nature.com/articles/s41467-018-07931-2","volume":"10"},
  {"id":"gayoso_joint_2021","abstract":"The paired measurement of RNA and surface proteins in single cells with cellular indexing of transcriptomes and epitopes by sequencing (CITE-seq) is a promising approach to connect transcriptional variation with cell phenotypes and functions. However, combining these paired views into a unified representation of cell state is made challenging by the unique technical characteristics of each measurement. Here we present Total Variational Inference (totalVI; https://scvi-tools.org), a framework for end-to-end joint analysis of CITE-seq data that probabilistically represents the data as a composite of biological and technical factors, including protein background and batch effects. To evaluate totalVI’s performance, we profiled immune cells from murine spleen and lymph nodes with CITE-seq, measuring over 100 surface proteins. We demonstrate that totalVI provides a cohesive solution for common analysis tasks such as dimensionality reduction, the integration of datasets with different measured proteins, estimation of correlations between molecules and differential expression testing.","accessed":{"date-parts":[[2021,3,9]]},"author":[{"family":"Gayoso","given":"Adam"},{"family":"Steier","given":"Zoë"},{"family":"Lopez","given":"Romain"},{"family":"Regier","given":"Jeffrey"},{"family":"Nazor","given":"Kristopher L."},{"family":"Streets","given":"Aaron"},{"family":"Yosef","given":"Nir"}],"container-title":"Nature Methods","DOI":"10.1038/s41592-020-01050-x","ISSN":"1548-7105","issued":{"date-parts":[[2021,2,15]]},"language":"en","page":"1-11","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Joint probabilistic modeling of single-cell multi-omic data with totalVI","type":"article-journal","URL":"https://www.nature.com/articles/s41592-020-01050-x"},
  {"id":"gelman_why_2009","abstract":"Applied researchers often find themselves making statistical inferences in settings that would seem to require multiple comparisons adjustments. We challenge the Type I error paradigm that underlies these corrections. Moreover we posit that the problem of multiple comparisons can disappear entirely when viewed from a hierarchical Bayesian perspective. We propose building multilevel models in the settings where multiple comparisons arise. Multilevel models perform partial pooling (shifting estimates toward each other), whereas classical procedures typically keep the centers of intervals stationary, adjusting for multiple comparisons by making the intervals wider (or, equivalently, adjusting the $p$-values corresponding to intervals of fixed width). Thus, multilevel models address the multiple comparisons problem and also yield more efficient estimates, especially in settings with low group-level variation, which is where multiple comparisons are a particular concern.","accessed":{"date-parts":[[2021,8,5]]},"author":[{"family":"Gelman","given":"Andrew"},{"family":"Hill","given":"Jennifer"},{"family":"Yajima","given":"Masanao"}],"container-title":"arXiv:0907.2478 [stat]","issued":{"date-parts":[[2009,7,14]]},"source":"arXiv.org","title":"Why we (usually) don't have to worry about multiple comparisons","type":"article-journal","URL":"http://arxiv.org/abs/0907.2478"},
  {"id":"gershman_amortized_2014","abstract":"Author(s): Gershman, Samuel; Goodman, Noah","accessed":{"date-parts":[[2021,1,24]]},"author":[{"family":"Gershman","given":"Samuel"},{"family":"Goodman","given":"Noah"}],"container-title":"Proceedings of the Annual Meeting of the Cognitive Science Society","ISSN":"1069-7977","issue":"36","issued":{"date-parts":[[2014]]},"language":"en","source":"escholarship.org","title":"Amortized Inference in Probabilistic Reasoning","type":"article-journal","URL":"https://escholarship.org/uc/item/34j1h7k5","volume":"36"},
  {"id":"hafemeister_normalization_2019","abstract":"Single-cell RNA-seq (scRNA-seq) data exhibits significant cell-to-cell variation due to technical factors, including the number of molecules detected in each cell, which can confound biological heterogeneity with technical effects. To address this, we present a modeling framework for the normalization and variance stabilization of molecular count data from scRNA-seq experiments. We propose that the Pearson residuals from “regularized negative binomial regression,” where cellular sequencing depth is utilized as a covariate in a generalized linear model, successfully remove the influence of technical characteristics from downstream analyses while preserving biological heterogeneity. Importantly, we show that an unconstrained negative binomial model may overfit scRNA-seq data, and overcome this by pooling information across genes with similar abundances to obtain stable parameter estimates. Our procedure omits the need for heuristic steps including pseudocount addition or log-transformation and improves common downstream analytical tasks such as variable gene selection, dimensional reduction, and differential expression. Our approach can be applied to any UMI-based scRNA-seq dataset and is freely available as part of the R package sctransform, with a direct interface to our single-cell toolkit Seurat.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Hafemeister","given":"Christoph"},{"family":"Satija","given":"Rahul"}],"container-title":"Genome Biology","container-title-short":"Genome Biology","DOI":"10.1186/s13059-019-1874-1","ISSN":"1474-760X","issue":"1","issued":{"date-parts":[[2019,12,23]]},"page":"296","source":"BioMed Central","title":"Normalization and variance stabilization of single-cell RNA-seq data using regularized negative binomial regression","type":"article-journal","URL":"https://doi.org/10.1186/s13059-019-1874-1","volume":"20"},
  {"id":"huang_note_2019","abstract":"In this note, we study the relationship between the variational gap and the variance of the (log) likelihood ratio. We show that the gap can be upper bounded by some form of dispersion measure of the likelihood ratio, which suggests the bias of variational inference can be reduced by making the distribution of the likelihood ratio more concentrated, such as via averaging and variance reduction.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Huang","given":"Chin-Wei"},{"family":"Courville","given":"Aaron"}],"container-title":"arXiv:1906.03708 [cs, stat]","issued":{"date-parts":[[2019,6,9]]},"source":"arXiv.org","title":"Note on the bias and variance of variational inference","type":"article-journal","URL":"http://arxiv.org/abs/1906.03708"},
  {"id":"jain_multimap_2021","abstract":"<p>Multimodal data is rapidly growing in many fields of science and engineering, including single-cell biology. We introduce MultiMAP, an approach for the dimensionality reduction and integration of multiple datasets. MultiMAP recovers a single manifold on which all of the data resides and then projects the data into a single low-dimensional space so as to preserve the structure of the manifold. MultiMAP is based on a framework of Riemannian geometry and algebraic topology, and generalizes the popular UMAP algorithm to the multimodal setting. MultiMAP can be used for visualization of multimodal data, and as an integration approach that enables joint analyses. MultiMAP has several advantages over existing integration strategies for single-cell data, including that MultiMAP can integrate any number of datasets, leverages features that are not present in all datasets (i.e. datasets can be of different dimensionalities), is not restricted to a linear mapping, can control the influence of each dataset on the embedding, and is extremely scalable to large datasets. We apply MultiMAP to the integration of a variety of single-cell transcriptomics, chromatin accessibility, methylation, and spatial data, and show that it outperforms current approaches in preservation of high-dimensional structure, alignment of datasets, visual separation of clusters, transfer learning, and runtime. On a newly generated single-cell Assay for Transposase-Accessible Chromatin using sequencing (scATAC-seq) and single-cell RNA-seq (scRNA-seq) dataset of the human thymus, we use MultiMAP to integrate cells along a temporal trajectory. This enables the quantitative comparison of transcription factor expression and binding site accessibility over the course of T cell differentiation, revealing patterns of transcription factor kinetics.</p>","accessed":{"date-parts":[[2021,3,9]]},"author":[{"family":"Jain","given":"Mika Sarkin"},{"family":"Conde","given":"Cecilia Dominguez"},{"family":"Polanski","given":"Krzysztof"},{"family":"Chen","given":"Xi"},{"family":"Park","given":"Jongeun"},{"family":"Botting","given":"Rachel A."},{"family":"Stephenson","given":"Emily"},{"family":"Haniffa","given":"Muzlifah"},{"family":"Lamacraft","given":"Austen"},{"family":"Efremova","given":"Mirjana"},{"family":"Teichmann","given":"Sarah A."}],"container-title":"bioRxiv","DOI":"10.1101/2021.02.16.431421","issued":{"date-parts":[[2021,2,17]]},"language":"en","page":"2021.02.16.431421","publisher":"Cold Spring Harbor Laboratory","section":"New Results","source":"www.biorxiv.org","title":"MultiMAP: Dimensionality Reduction and Integration of Multimodal Data","title-short":"MultiMAP","type":"article-journal","URL":"https://www.biorxiv.org/content/10.1101/2021.02.16.431421v1"},
  {"id":"jang_categorical_2017","abstract":"Categorical variables are a natural choice for representing discrete structure in the world. However, stochastic neural networks rarely use categorical latent variables due to the inability to backpropagate through samples. In this work, we present an efficient gradient estimator that replaces the non-differentiable sample from a categorical distribution with a differentiable sample from a novel Gumbel-Softmax distribution. This distribution has the essential property that it can be smoothly annealed into a categorical distribution. We show that our Gumbel-Softmax estimator outperforms state-of-the-art gradient estimators on structured output prediction and unsupervised generative modeling tasks with categorical latent variables, and enables large speedups on semi-supervised classification.","accessed":{"date-parts":[[2021,4,21]]},"author":[{"family":"Jang","given":"Eric"},{"family":"Gu","given":"Shixiang"},{"family":"Poole","given":"Ben"}],"container-title":"arXiv:1611.01144 [cs, stat]","issued":{"date-parts":[[2017,8,5]]},"source":"arXiv.org","title":"Categorical Reparameterization with Gumbel-Softmax","type":"article-journal","URL":"http://arxiv.org/abs/1611.01144"},
  {"id":"keating_sbml_2020","abstract":"Abstract Systems biology has experienced dramatic growth in the number, size, and complexity of computational models. To reproduce simulation results and reuse models, researchers must exchange unambiguous model descriptions. We review the latest edition of the Systems Biology Markup Language (SBML), a format designed for this purpose. A community of modelers and software authors developed SBML Level 3 over the past decade. Its modular form consists of a core suited to representing reaction-based models and packages that extend the core with features suited to other model types including constraint-based models, reaction-diffusion models, logical network models, and rule-based models. The format leverages two decades of SBML and a rich software ecosystem that transformed how systems biologists build and interact with models. More recently, the rise of multiscale models of whole cells and organs, and new data sources such as single-cell measurements and live imaging, has precipitated new ways of integrating data with models. We provide our perspectives on the challenges presented by these developments and how SBML Level 3 provides the foundation needed to support this evolution.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Keating","given":"Sarah M"},{"family":"Waltemath","given":"Dagmar"},{"family":"König","given":"Matthias"},{"family":"Zhang","given":"Fengkai"},{"family":"Dräger","given":"Andreas"},{"family":"Chaouiya","given":"Claudine"},{"family":"Bergmann","given":"Frank T"},{"family":"Finney","given":"Andrew"},{"family":"Gillespie","given":"Colin S"},{"family":"Helikar","given":"Tomáš"},{"family":"Hoops","given":"Stefan"},{"family":"Malik-Sheriff","given":"Rahuman S"},{"family":"Moodie","given":"Stuart L"},{"family":"Moraru","given":"Ion I"},{"family":"Myers","given":"Chris J"},{"family":"Naldi","given":"Aurélien"},{"family":"Olivier","given":"Brett G"},{"family":"Sahle","given":"Sven"},{"family":"Schaff","given":"James C"},{"family":"Smith","given":"Lucian P"},{"family":"Swat","given":"Maciej J"},{"family":"Thieffry","given":"Denis"},{"family":"Watanabe","given":"Leandro"},{"family":"Wilkinson","given":"Darren J"},{"family":"Blinov","given":"Michael L"},{"family":"Begley","given":"Kimberly"},{"family":"Faeder","given":"James R"},{"family":"Gómez","given":"Harold F"},{"family":"Hamm","given":"Thomas M"},{"family":"Inagaki","given":"Yuichiro"},{"family":"Liebermeister","given":"Wolfram"},{"family":"Lister","given":"Allyson L"},{"family":"Lucio","given":"Daniel"},{"family":"Mjolsness","given":"Eric"},{"family":"Proctor","given":"Carole J"},{"family":"Raman","given":"Karthik"},{"family":"Rodriguez","given":"Nicolas"},{"family":"Shaffer","given":"Clifford A"},{"family":"Shapiro","given":"Bruce E"},{"family":"Stelling","given":"Joerg"},{"family":"Swainston","given":"Neil"},{"family":"Tanimura","given":"Naoki"},{"family":"Wagner","given":"John"},{"family":"Meier-Schellersheim","given":"Martin"},{"family":"Sauro","given":"Herbert M"},{"family":"Palsson","given":"Bernhard"},{"family":"Bolouri","given":"Hamid"},{"family":"Kitano","given":"Hiroaki"},{"family":"Funahashi","given":"Akira"},{"family":"Hermjakob","given":"Henning"},{"family":"Doyle","given":"John C"},{"family":"Hucka","given":"Michael"},{"literal":"SBML Level 3 Community members"}],"container-title":"Molecular Systems Biology","container-title-short":"Molecular Systems Biology","DOI":"10.15252/msb.20199110","ISSN":"1744-4292","issue":"8","issued":{"date-parts":[[2020,8,1]]},"page":"e9110","publisher":"John Wiley & Sons, Ltd","source":"embopress.org (Atypon)","title":"SBML Level 3: an extensible format for the exchange and reuse of biological models","title-short":"SBML Level 3","type":"article-journal","URL":"https://www.embopress.org/doi/full/10.15252/msb.20199110","volume":"16"},
  {"id":"kingma_auto-encoding_2014","abstract":"How can we perform efficient inference and learning in directed probabilistic models, in the presence of continuous latent variables with intractable posterior distributions, and large datasets? We introduce a stochastic variational inference and learning algorithm that scales to large datasets and, under some mild differentiability conditions, even works in the intractable case. Our contributions is two-fold. First, we show that a reparameterization of the variational lower bound yields a lower bound estimator that can be straightforwardly optimized using standard stochastic gradient methods. Second, we show that for i.i.d. datasets with continuous latent variables per datapoint, posterior inference can be made especially efficient by fitting an approximate inference model (also called a recognition model) to the intractable posterior using the proposed lower bound estimator. Theoretical advantages are reflected in experimental results.","accessed":{"date-parts":[[2021,4,21]]},"author":[{"family":"Kingma","given":"Diederik P."},{"family":"Welling","given":"Max"}],"container-title":"arXiv:1312.6114 [cs, stat]","issued":{"date-parts":[[2014,5,1]]},"source":"arXiv.org","title":"Auto-Encoding Variational Bayes","type":"article-journal","URL":"http://arxiv.org/abs/1312.6114"},
  {"id":"kleshchevnikov_comprehensive_2020","abstract":"<h3>Abstract</h3> <p>The spatial organization of cell types in tissues fundamentally shapes cellular interactions and function, but the high-throughput spatial mapping of complex tissues remains a challenge. We present сell2location, a principled and versatile Bayesian model that integrates single-cell and spatial transcriptomics to map cell types <i>in situ</i> in a comprehensive manner. We show that сell2location outperforms existing tools in accuracy and comprehensiveness and we demonstrate its utility by mapping two complex tissues. In the mouse brain, we use a new paired single nucleus and spatial RNA-sequencing dataset to map dozens of cell types and identify tissue regions in an automated manner. We discover novel regional astrocyte subtypes including fine subpopulations in the thalamus and hypothalamus. In the human lymph node, we resolve spatially interlaced immune cell states and identify co-located groups of cells underlying tissue organisation. We spatially map a rare pre-germinal centre B-cell population and predict putative cellular interactions relevant to the interferon response. Collectively our results demonstrate how сell2location can serve as a versatile first-line analysis tool to map tissue architectures in a high-throughput manner.</p>","accessed":{"date-parts":[[2021,2,11]]},"author":[{"family":"Kleshchevnikov","given":"Vitalii"},{"family":"Shmatko","given":"Artem"},{"family":"Dann","given":"Emma"},{"family":"Aivazidis","given":"Alexander"},{"family":"King","given":"Hamish W."},{"family":"Li","given":"Tong"},{"family":"Lomakin","given":"Artem"},{"family":"Kedlian","given":"Veronika"},{"family":"Jain","given":"Mika Sarkin"},{"family":"Park","given":"Jun Sung"},{"family":"Ramona","given":"Lauma"},{"family":"Tuck","given":"Elizabeth"},{"family":"Arutyunyan","given":"Anna"},{"family":"Vento-Tormo","given":"Roser"},{"family":"Gerstung","given":"Moritz"},{"family":"James","given":"Louisa"},{"family":"Stegle","given":"Oliver"},{"family":"Bayraktar","given":"Omer Ali"}],"container-title":"bioRxiv","DOI":"10.1101/2020.11.15.378125","issued":{"date-parts":[[2020,11,17]]},"language":"en","page":"2020.11.15.378125","publisher":"Cold Spring Harbor Laboratory","section":"New Results","source":"www.biorxiv.org","title":"Comprehensive mapping of tissue cell architecture via integrated single cell and spatial transcriptomics","type":"article-journal","URL":"https://www.biorxiv.org/content/10.1101/2020.11.15.378125v1"},
  {"id":"kueh_positive_2013","abstract":"A Different Cycle for Differentiation\nThe regulated expression of transcription factors determines cell fate decisions during cell differentiation. The transcription factor PU.1 is an important determinant in the differentiation of hematopoietic progenitors to lymphocytes or myeloid cells, where high expression induces macrophage differentiation, whereas low expression leads to the development of B lymphocytes. How PU.1 expression levels are regulated during this cell fate choice, however, is not well understood. Kueh et al. (p. 670, published online 18 July) found that in mice, reduced transcription of PU.1 led to its reduced expression in developing B lymphocytes, whereas in macrophages, PU.1 was able to accumulate stably because of a lengthening of the cell cycle. Exogenous expression of PU.1 in progenitors supported cell cycle lengthening and macrophage differentiation, and mathematical modeling suggested that such a feedback loop could maintain a slow-dividing macrophage developmental state.\nRegulatory gene circuits with positive-feedback loops control stem cell differentiation, but several mechanisms can contribute to positive feedback. Here, we dissect feedback mechanisms through which the transcription factor PU.1 controls lymphoid and myeloid differentiation. Quantitative live-cell imaging revealed that developing B cells decrease PU.1 levels by reducing PU.1 transcription, whereas developing macrophages increase PU.1 levels by lengthening their cell cycles, which causes stable PU.1 accumulation. Exogenous PU.1 expression in progenitors increases endogenous PU.1 levels by inducing cell cycle lengthening, implying positive feedback between a regulatory factor and the cell cycle. Mathematical modeling showed that this cell cycle–coupled feedback architecture effectively stabilizes a slow-dividing differentiated state. These results show that cell cycle duration functions as an integral part of a positive autoregulatory circuit to control cell fate.\nRegulation of cell cycle length is a feedback mechanism that controls cell fate decisions in developing macrophages.\nRegulation of cell cycle length is a feedback mechanism that controls cell fate decisions in developing macrophages.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Kueh","given":"Hao Yuan"},{"family":"Champhekar","given":"Ameya"},{"family":"Nutt","given":"Stephen L."},{"family":"Elowitz","given":"Michael B."},{"family":"Rothenberg","given":"Ellen V."}],"container-title":"Science","DOI":"10.1126/science.1240831","ISSN":"0036-8075, 1095-9203","issue":"6146","issued":{"date-parts":[[2013,8,9]]},"language":"en","page":"670-673","PMID":"23868921","publisher":"American Association for the Advancement of Science","section":"Report","source":"science.sciencemag.org","title":"Positive Feedback Between PU.1 and the Cell Cycle Controls Myeloid Differentiation","type":"article-journal","URL":"https://science.sciencemag.org/content/341/6146/670","volume":"341"},
  {"id":"la_manno_rna_2018","abstract":"RNA abundance is a powerful indicator of the state of individual cells. Single-cell RNA sequencing can reveal RNA abundance with high quantitative accuracy, sensitivity and throughput1. However, this approach captures only a static snapshot at a point in time, posing a challenge for the analysis of time-resolved phenomena such as embryogenesis or tissue regeneration. Here we show that RNA velocity—the time derivative of the gene expression state—can be directly estimated by distinguishing between unspliced and spliced mRNAs in common single-cell RNA sequencing protocols. RNA velocity is a high-dimensional vector that predicts the future state of individual cells on a timescale of hours. We validate its accuracy in the neural crest lineage, demonstrate its use on multiple published datasets and technical platforms, reveal the branching lineage tree of the developing mouse hippocampus, and examine the kinetics of transcription in human embryonic brain. We expect RNA velocity to greatly aid the analysis of developmental lineages and cellular dynamics, particularly in humans.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"La Manno","given":"Gioele"},{"family":"Soldatov","given":"Ruslan"},{"family":"Zeisel","given":"Amit"},{"family":"Braun","given":"Emelie"},{"family":"Hochgerner","given":"Hannah"},{"family":"Petukhov","given":"Viktor"},{"family":"Lidschreiber","given":"Katja"},{"family":"Kastriti","given":"Maria E."},{"family":"Lönnerberg","given":"Peter"},{"family":"Furlan","given":"Alessandro"},{"family":"Fan","given":"Jean"},{"family":"Borm","given":"Lars E."},{"family":"Liu","given":"Zehua"},{"family":"Bruggen","given":"David","non-dropping-particle":"van"},{"family":"Guo","given":"Jimin"},{"family":"He","given":"Xiaoling"},{"family":"Barker","given":"Roger"},{"family":"Sundström","given":"Erik"},{"family":"Castelo-Branco","given":"Gonçalo"},{"family":"Cramer","given":"Patrick"},{"family":"Adameyko","given":"Igor"},{"family":"Linnarsson","given":"Sten"},{"family":"Kharchenko","given":"Peter V."}],"container-title":"Nature","DOI":"10.1038/s41586-018-0414-6","ISSN":"1476-4687","issue":"7719","issued":{"date-parts":[[2018,8]]},"language":"en","number":"7719","page":"494-498","publisher":"Nature Publishing Group","source":"www.nature.com","title":"RNA velocity of single cells","type":"article-journal","URL":"https://www.nature.com/articles/s41586-018-0414-6","volume":"560"},
  {"id":"liu_stem_2019","abstract":"Stem cells underlie tissue homeostasis, but their dynamics during ageing—and the relevance of these dynamics to organ ageing—remain unknown. Here we report that the expression of the hemidesmosome component collagen XVII (COL17A1) by epidermal stem cells fluctuates physiologically through genomic/oxidative stress-induced proteolysis, and that the resulting differential expression of COL17A1 in individual stem cells generates a driving force for cell competition. In vivo clonal analysis in mice and in vitro 3D modelling show that clones that express high levels of COL17A1, which divide symmetrically, outcompete and eliminate adjacent stressed clones that express low levels of COL17A1, which divide asymmetrically. Stem cells with higher potential or quality are thus selected for homeostasis, but their eventual loss of COL17A1 limits their competition, thereby causing ageing. The resultant hemidesmosome fragility and stem cell delamination deplete adjacent melanocytes and fibroblasts to promote skin ageing. Conversely, the forced maintenance of COL17A1 rescues skin organ ageing, thereby indicating potential angles for anti-ageing therapeutic intervention.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Liu","given":"Nan"},{"family":"Matsumura","given":"Hiroyuki"},{"family":"Kato","given":"Tomoki"},{"family":"Ichinose","given":"Shizuko"},{"family":"Takada","given":"Aki"},{"family":"Namiki","given":"Takeshi"},{"family":"Asakawa","given":"Kyosuke"},{"family":"Morinaga","given":"Hironobu"},{"family":"Mohri","given":"Yasuaki"},{"family":"De Arcangelis","given":"Adèle"},{"family":"Geroges-Labouesse","given":"Elisabeth"},{"family":"Nanba","given":"Daisuke"},{"family":"Nishimura","given":"Emi K."}],"container-title":"Nature","DOI":"10.1038/s41586-019-1085-7","ISSN":"1476-4687","issue":"7752","issued":{"date-parts":[[2019,4]]},"language":"en","number":"7752","page":"344-350","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Stem cell competition orchestrates skin homeostasis and ageing","type":"article-journal","URL":"https://www.nature.com/articles/s41586-019-1085-7","volume":"568"},
  {"id":"lopez_deep_2018","abstract":"Single-cell transcriptome measurements can reveal unexplored biological diversity, but they suffer from technical noise and bias that must be modeled to account for the resulting uncertainty in downstream analyses. Here we introduce single-cell variational inference (scVI), a ready-to-use scalable framework for the probabilistic representation and analysis of gene expression in single cells (https://github.com/YosefLab/scVI). scVI uses stochastic optimization and deep neural networks to aggregate information across similar cells and genes and to approximate the distributions that underlie observed expression values, while accounting for batch effects and limited sensitivity. We used scVI for a range of fundamental analysis tasks including batch correction, visualization, clustering, and differential expression, and achieved high accuracy for each task.","accessed":{"date-parts":[[2021,1,20]]},"author":[{"family":"Lopez","given":"Romain"},{"family":"Regier","given":"Jeffrey"},{"family":"Cole","given":"Michael B."},{"family":"Jordan","given":"Michael I."},{"family":"Yosef","given":"Nir"}],"container-title":"Nature Methods","DOI":"10.1038/s41592-018-0229-2","ISSN":"1548-7105","issue":"12","issued":{"date-parts":[[2018,12]]},"language":"en","number":"12","page":"1053-1058","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Deep generative modeling for single-cell transcriptomics","type":"article-journal","URL":"https://www.nature.com/articles/s41592-018-0229-2","volume":"15"},
  {"id":"maddison_concrete_2017","abstract":"The reparameterization trick enables optimizing large scale stochastic computation graphs via gradient descent. The essence of the trick is to refactor each stochastic node into a differentiable function of its parameters and a random variable with fixed distribution. After refactoring, the gradients of the loss propagated by the chain rule through the graph are low variance unbiased estimators of the gradients of the expected loss. While many continuous random variables have such reparameterizations, discrete random variables lack useful reparameterizations due to the discontinuous nature of discrete states. In this work we introduce Concrete random variables---continuous relaxations of discrete random variables. The Concrete distribution is a new family of distributions with closed form densities and a simple reparameterization. Whenever a discrete stochastic node of a computation graph can be refactored into a one-hot bit representation that is treated continuously, Concrete stochastic nodes can be used with automatic differentiation to produce low-variance biased gradients of objectives (including objectives that depend on the log-probability of latent stochastic nodes) on the corresponding discrete graph. We demonstrate the effectiveness of Concrete relaxations on density estimation and structured prediction tasks using neural networks.","accessed":{"date-parts":[[2021,4,21]]},"author":[{"family":"Maddison","given":"Chris J."},{"family":"Mnih","given":"Andriy"},{"family":"Teh","given":"Yee Whye"}],"container-title":"arXiv:1611.00712 [cs, stat]","issued":{"date-parts":[[2017,3,5]]},"source":"arXiv.org","title":"The Concrete Distribution: A Continuous Relaxation of Discrete Random Variables","title-short":"The Concrete Distribution","type":"article-journal","URL":"http://arxiv.org/abs/1611.00712"},
  {"id":"mcginnis_multi-seq_2019","abstract":"Sample multiplexing facilitates scRNA-seq by reducing costs and identifying artifacts such as cell doublets. However, universal and scalable sample barcoding strategies have not been described. We therefore developed MULTI-seq: multiplexing using lipid-tagged indices for single-cell and single-nucleus RNA sequencing. MULTI-seq reagents can barcode any cell type or nucleus from any species with an accessible plasma membrane. The method involves minimal sample processing, thereby preserving cell viability and endogenous gene expression patterns. When cells are classified into sample groups using MULTI-seq barcode abundances, data quality is improved through doublet identification and recovery of cells with low RNA content that would otherwise be discarded by standard quality-control workflows. We use MULTI-seq to track the dynamics of T-cell activation, perform a 96-plex perturbation experiment with primary human mammary epithelial cells and multiplex cryopreserved tumors and metastatic sites isolated from a patient-derived xenograft mouse model of triple-negative breast cancer.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"McGinnis","given":"Christopher S."},{"family":"Patterson","given":"David M."},{"family":"Winkler","given":"Juliane"},{"family":"Conrad","given":"Daniel N."},{"family":"Hein","given":"Marco Y."},{"family":"Srivastava","given":"Vasudha"},{"family":"Hu","given":"Jennifer L."},{"family":"Murrow","given":"Lyndsay M."},{"family":"Weissman","given":"Jonathan S."},{"family":"Werb","given":"Zena"},{"family":"Chow","given":"Eric D."},{"family":"Gartner","given":"Zev J."}],"container-title":"Nature Methods","DOI":"10.1038/s41592-019-0433-8","ISSN":"1548-7105","issue":"7","issued":{"date-parts":[[2019,7]]},"language":"en","number":"7","page":"619-626","publisher":"Nature Publishing Group","source":"www.nature.com","title":"MULTI-seq: sample multiplexing for single-cell RNA sequencing using lipid-tagged indices","title-short":"MULTI-seq","type":"article-journal","URL":"https://www.nature.com/articles/s41592-019-0433-8","volume":"16"},
  {"id":"mcinnes_umap_2020","abstract":"UMAP (Uniform Manifold Approximation and Projection) is a novel manifold learning technique for dimension reduction. UMAP is constructed from a theoretical framework based in Riemannian geometry and algebraic topology. The result is a practical scalable algorithm that applies to real world data. The UMAP algorithm is competitive with t-SNE for visualization quality, and arguably preserves more of the global structure with superior run time performance. Furthermore, UMAP has no computational restrictions on embedding dimension, making it viable as a general purpose dimension reduction technique for machine learning.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"McInnes","given":"Leland"},{"family":"Healy","given":"John"},{"family":"Melville","given":"James"}],"container-title":"arXiv:1802.03426 [cs, stat]","issued":{"date-parts":[[2020,9,17]]},"source":"arXiv.org","title":"UMAP: Uniform Manifold Approximation and Projection for Dimension Reduction","title-short":"UMAP","type":"article-journal","URL":"http://arxiv.org/abs/1802.03426"},
  {"id":"mimitou_multiplexed_2019","abstract":"Multimodal single-cell assays provide high-resolution snapshots of complex cell populations, but are mostly limited to transcriptome plus an additional modality. Here, we describe expanded CRISPR-compatible cellular indexing of transcriptomes and epitopes by sequencing (ECCITE-seq) for the high-throughput characterization of at least five modalities of information from each single cell. We demonstrate application of ECCITE-seq to multimodal CRISPR screens with robust direct single-guide RNA capture and to clonotype-aware multimodal phenotyping of cancer samples.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Mimitou","given":"Eleni P."},{"family":"Cheng","given":"Anthony"},{"family":"Montalbano","given":"Antonino"},{"family":"Hao","given":"Stephanie"},{"family":"Stoeckius","given":"Marlon"},{"family":"Legut","given":"Mateusz"},{"family":"Roush","given":"Timothy"},{"family":"Herrera","given":"Alberto"},{"family":"Papalexi","given":"Efthymia"},{"family":"Ouyang","given":"Zhengqing"},{"family":"Satija","given":"Rahul"},{"family":"Sanjana","given":"Neville E."},{"family":"Koralov","given":"Sergei B."},{"family":"Smibert","given":"Peter"}],"container-title":"Nature Methods","DOI":"10.1038/s41592-019-0392-0","ISSN":"1548-7105","issue":"5","issued":{"date-parts":[[2019,5]]},"language":"en","number":"5","page":"409-412","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Multiplexed detection of proteins, transcriptomes, clonotypes and CRISPR perturbations in single cells","type":"article-journal","URL":"https://www.nature.com/articles/s41592-019-0392-0","volume":"16"},
  {"id":"mukhtar_untangling_2018","abstract":"The cerebral cortex is composed of billions of morphologically and functionally distinct neurons. These neurons are produced and organized in a regimental fashion during development. The ability of neurons to encode and elicit complex cognitive and motor functions depends on their precise molecular processes, identity, and connectivity established during development. Elucidating the cellular and molecular mechanisms that regulate development of the neocortex has been a challenge for many years. The cerebral cortical neuronal subtypes are classified based on morphology, function, intrinsic synaptic properties, location, connectivity, and marker gene expression. Development of the neocortex requires an orchestration of a series of processes including the appropriate determination, migration and positioning of the neurons, acquisition of layer-specific transcriptional hallmarks, and formation of precise axonal projections and networks. Historically, fate mapping, genome-wide analysis, and transcriptome profiling have provided many opportunities for the characterization of neuronal subtypes. During the course of this review, we will address the regimental organization of the cerebral cortex, dissect the cellular subtypes that contribute to cortical complexity, and outline their molecular hallmarks to understand cellular diversity in the cerebral cortex with a focus on the excitatory neurons.","accessed":{"date-parts":[[2021,3,9]]},"author":[{"family":"Mukhtar","given":"Tanzila"},{"family":"Taylor","given":"Verdon"}],"container-title":"Journal of Experimental Neuroscience","container-title-short":"J Exp Neurosci","DOI":"10.1177/1179069518759332","ISSN":"1179-0695","issued":{"date-parts":[[2018,3,1]]},"PMCID":"PMC5846925","PMID":"29551911","source":"PubMed Central","title":"Untangling Cortical Complexity During Development","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5846925/","volume":"12"},
  {"id":"norman_exploring_2019","abstract":"Manifold destiny\nMapping of genetic interactions (GIs) is usually based on cell fitness as the phenotypic readout, which obscures the mechanistic origin of interactions. Norman et al. developed a framework for mapping and understanding GIs. This approach leverages high-dimensional single-cell RNA sequencing data gathered from CRISPR-mediated, pooled perturbation screens. Diverse transcriptomic phenotypes construct a “manifold” representing all possible states of the cell. Each perturbation and GI projects the cell state to a particular position on this manifold, enabling unbiased ordering of genes in pathways and systematic classifications of GIs.\nScience, this issue p. 786\nHow cellular and organismal complexity emerges from combinatorial expression of genes is a central question in biology. High-content phenotyping approaches such as Perturb-seq (single-cell RNA-sequencing pooled CRISPR screens) present an opportunity for exploring such genetic interactions (GIs) at scale. Here, we present an analytical framework for interpreting high-dimensional landscapes of cell states (manifolds) constructed from transcriptional phenotypes. We applied this approach to Perturb-seq profiling of strong GIs mined from a growth-based, gain-of-function GI map. Exploration of this manifold enabled ordering of regulatory pathways, principled classification of GIs (e.g., identifying suppressors), and mechanistic elucidation of synergistic interactions, including an unexpected synergy between CBL and CNN1 driving erythroid differentiation. Finally, we applied recommender system machine learning to predict interactions, facilitating exploration of vastly larger GI manifolds.\nRich phenotyping with single-cell RNA sequencing reveals principles and mechanisms of genetic interactions in mammalian cells.\nRich phenotyping with single-cell RNA sequencing reveals principles and mechanisms of genetic interactions in mammalian cells.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Norman","given":"Thomas M."},{"family":"Horlbeck","given":"Max A."},{"family":"Replogle","given":"Joseph M."},{"family":"Ge","given":"Alex Y."},{"family":"Xu","given":"Albert"},{"family":"Jost","given":"Marco"},{"family":"Gilbert","given":"Luke A."},{"family":"Weissman","given":"Jonathan S."}],"container-title":"Science","DOI":"10.1126/science.aax4438","ISSN":"0036-8075, 1095-9203","issue":"6455","issued":{"date-parts":[[2019,8,23]]},"language":"en","page":"786-793","PMID":"31395745","publisher":"American Association for the Advancement of Science","section":"Research Article","source":"science.sciencemag.org","title":"Exploring genetic interaction manifolds constructed from rich single-cell phenotypes","type":"article-journal","URL":"https://science.sciencemag.org/content/365/6455/786","volume":"365"},
  {"id":"papalexi_characterizing_2021","abstract":"The expression of inhibitory immune checkpoint molecules, such as programmed death-ligand (PD-L)1, is frequently observed in human cancers and can lead to the suppression of T cell–mediated immune responses. Here, we apply expanded CRISPR-compatible (EC)CITE-seq, a technology that combines pooled CRISPR screens with single-cell mRNA and surface protein measurements, to explore the molecular networks that regulate PD-L1 expression. We also develop a computational framework, mixscape, that substantially improves the signal-to-noise ratio in single-cell perturbation screens by identifying and removing confounding sources of variation. Applying these tools, we identify and validate regulators of PD-L1 and leverage our multimodal data to identify both transcriptional and post-transcriptional modes of regulation. Specifically, we discover that the Kelch-like protein KEAP1 and the transcriptional activator NRF2 mediate the upregulation of PD-L1 after interferon (IFN)-γ stimulation. Our results identify a new mechanism for the regulation of immune checkpoints and present a powerful analytical framework for the analysis of multimodal single-cell perturbation screens.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Papalexi","given":"Efthymia"},{"family":"Mimitou","given":"Eleni P."},{"family":"Butler","given":"Andrew W."},{"family":"Foster","given":"Samantha"},{"family":"Bracken","given":"Bernadette"},{"family":"Mauck","given":"William M."},{"family":"Wessels","given":"Hans-Hermann"},{"family":"Hao","given":"Yuhan"},{"family":"Yeung","given":"Bertrand Z."},{"family":"Smibert","given":"Peter"},{"family":"Satija","given":"Rahul"}],"container-title":"Nature Genetics","DOI":"10.1038/s41588-021-00778-2","ISSN":"1546-1718","issue":"3","issued":{"date-parts":[[2021,3]]},"language":"en","number":"3","page":"322-331","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Characterizing the molecular regulation of inhibitory immune checkpoints with multimodal single-cell screens","type":"article-journal","URL":"https://www.nature.com/articles/s41588-021-00778-2","volume":"53"},
  {"id":"paramio_modulation_1999","abstract":"The members of the large keratin family of cytoskeletal proteins are expressed in a carefully regulated tissue- and differentiation-specific manner. Although these proteins are thought to be involved in imparting mechanical integrity to epithelial cells, the functional significance of their complex differential expression is still unclear. Here we provide new data suggesting that the expression of particular keratins may influence cell proliferation. Specifically, we demonstrate that the ectopic expression of K10 inhibits the proliferation of human keratinocytes in culture, while K16 expression appears to promote the proliferation of these cells. Other keratins, such as K13 or K14, do not significantly alter this parameter. K10-induced inhibition is reversed by the coexpression of K16 but not that of K14. These results are coherent with the observed expression pattern of these proteins in the epidermis: basal, proliferative keratinocytes express K14; when they terminally differentiate, keratinocytes switch off K14 and start K10 expression, whereas in response to hyperproliferative stimuli, K16 replaces K10. The characteristics of this process indicate that K10 and K16 act on the retinoblastoma (Rb) pathway, as (i) K10-induced inhibition is hampered by cotransfection with viral oncoproteins which interfere with pRb but not with p53; (ii) K10-mediated cell growth arrest is rescued by the coexpression of specific cyclins, cyclin-dependent kinases (CDKs), or cyclin-CDK complexes; (iii) K10-induced inhibition does not take place in Rb-deficient cells but is restored in these cells by cotransfection with pRb or p107 but not p130; (iv) K16 efficiently rescues the cell growth arrest induced by pRb in HaCaT cells but not that induced by p107 or p130; and (v) pRb phosphorylation and cyclin D1 expression are reduced in K10-transfected cells and increased in K16-transfected cells. Finally, using K10 deletion mutants, we map this inhibitory function to the nonhelical terminal domains of K10, hypervariable regions in which keratin-specific functions are thought to reside, and demonstrate that the presence of one of these domains is sufficient to promote cell growth arrest.","accessed":{"date-parts":[[2021,1,29]]},"author":[{"family":"Paramio","given":"Jesús M."},{"family":"Casanova","given":"M. Llanos"},{"family":"Segrelles","given":"Carmen"},{"family":"Mittnacht","given":"Sybille"},{"family":"Lane","given":"E. Birgitte"},{"family":"Jorcano","given":"José L."}],"container-title":"Molecular and Cellular Biology","DOI":"10.1128/MCB.19.4.3086","ISSN":"0270-7306, 1098-5549","issue":"4","issued":{"date-parts":[[1999,4,1]]},"language":"en","page":"3086-3094","PMID":"10082575","publisher":"American Society for Microbiology Journals","section":"CELL GROWTH AND DEVELOPMENT","source":"mcb.asm.org","title":"Modulation of Cell Proliferation by Cytokeratins K10 and K16","type":"article-journal","URL":"https://mcb.asm.org/content/19/4/3086","volume":"19"},
  {"id":"paszke_automatic_2017","abstract":"A summary of automatic differentiation techniques employed in PyTorch library, including novelties like support for in-place modification in presence of objects aliasing the same data, performance...","accessed":{"date-parts":[[2021,4,21]]},"author":[{"family":"Paszke","given":"Adam"},{"family":"Gross","given":"Sam"},{"family":"Chintala","given":"Soumith"},{"family":"Chanan","given":"Gregory"},{"family":"Yang","given":"Edward"},{"family":"DeVito","given":"Zachary"},{"family":"Lin","given":"Zeming"},{"family":"Desmaison","given":"Alban"},{"family":"Antiga","given":"Luca"},{"family":"Lerer","given":"Adam"}],"issued":{"date-parts":[[2017,10,28]]},"language":"en","source":"openreview.net","title":"Automatic differentiation in PyTorch","type":"article-journal","URL":"https://openreview.net/forum?id=BJJsrmfCZ"},
  {"id":"paszke_pytorch_2019","abstract":"Deep learning frameworks have often focused on either usability or speed, but not both. PyTorch is a machine learning library that shows that these two goals are in fact compatible: it provides an imperative and Pythonic programming style that supports code as a model, makes debugging easy and is consistent with other popular scientific computing libraries, while remaining efficient and supporting hardware accelerators such as GPUs. In this paper, we detail the principles that drove the implementation of PyTorch and how they are reflected in its architecture. We emphasize that every aspect of PyTorch is a regular Python program under the full control of its user. We also explain how the careful and pragmatic implementation of the key components of its runtime enables them to work together to achieve compelling performance. We demonstrate the efficiency of individual subsystems, as well as the overall speed of PyTorch on several common benchmarks.","accessed":{"date-parts":[[2021,4,29]]},"author":[{"family":"Paszke","given":"Adam"},{"family":"Gross","given":"Sam"},{"family":"Massa","given":"Francisco"},{"family":"Lerer","given":"Adam"},{"family":"Bradbury","given":"James"},{"family":"Chanan","given":"Gregory"},{"family":"Killeen","given":"Trevor"},{"family":"Lin","given":"Zeming"},{"family":"Gimelshein","given":"Natalia"},{"family":"Antiga","given":"Luca"},{"family":"Desmaison","given":"Alban"},{"family":"Köpf","given":"Andreas"},{"family":"Yang","given":"Edward"},{"family":"DeVito","given":"Zach"},{"family":"Raison","given":"Martin"},{"family":"Tejani","given":"Alykhan"},{"family":"Chilamkurthy","given":"Sasank"},{"family":"Steiner","given":"Benoit"},{"family":"Fang","given":"Lu"},{"family":"Bai","given":"Junjie"},{"family":"Chintala","given":"Soumith"}],"container-title":"arXiv:1912.01703 [cs, stat]","issued":{"date-parts":[[2019,12,3]]},"source":"arXiv.org","title":"PyTorch: An Imperative Style, High-Performance Deep Learning Library","title-short":"PyTorch","type":"article-journal","URL":"http://arxiv.org/abs/1912.01703"},
  {"id":"ranganath_black_2013","abstract":"Variational inference has become a widely used method to approximate posteriors in complex latent variables models. However, deriving a variational inference algorithm generally requires significant model-specific analysis, and these efforts can hinder and deter us from quickly developing and exploring a variety of models for a problem at hand. In this paper, we present a \"black box\" variational inference algorithm, one that can be quickly applied to many models with little additional derivation. Our method is based on a stochastic optimization of the variational objective where the noisy gradient is computed from Monte Carlo samples from the variational distribution. We develop a number of methods to reduce the variance of the gradient, always maintaining the criterion that we want to avoid difficult model-based derivations. We evaluate our method against the corresponding black box sampling based methods. We find that our method reaches better predictive likelihoods much faster than sampling methods. Finally, we demonstrate that Black Box Variational Inference lets us easily explore a wide space of models by quickly constructing and evaluating several models of longitudinal healthcare data.","accessed":{"date-parts":[[2021,1,20]]},"author":[{"family":"Ranganath","given":"Rajesh"},{"family":"Gerrish","given":"Sean"},{"family":"Blei","given":"David M."}],"container-title":"arXiv:1401.0118 [cs, stat]","issued":{"date-parts":[[2013,12,31]]},"source":"arXiv.org","title":"Black Box Variational Inference","type":"article-journal","URL":"http://arxiv.org/abs/1401.0118"},
  {"id":"rebboah_mapping_2021","abstract":"<p>Alternative RNA isoforms are defined by promoter choice, alternative splicing, and polyA site selection. Although differential isoform expression is known to play a large regulatory role in eukaryotes, it has proved challenging to study with standard short-read RNA-seq because of the uncertainties it leaves about the full-length structure and precise termini of transcripts. The rise in throughput and quality of long-read sequencing now makes it possible, in principle, to unambiguously identify most transcript isoforms from beginning to end. However, its application to single-cell RNA-seq has been limited by throughput and expense. Here, we develop and characterize long-read Split-seq (LR-Split-seq), which uses a combinatorial barcoding-based method for sequencing single cells and nuclei with long reads. We show that LR-Split-seq can associate isoforms with cell types with relative economy and design flexibility. We characterize LR-Split-seq for whole cells and nuclei by using the well-studied mouse C2C12 system in which mononucleated myoblast cells differentiate and fuse into multinucleated myotubes. We show that the overall results are reproducible when comparing long- and short-read data from the same cell or nucleus. We find substantial evidence of differential isoform expression during differentiation including alternative transcription start site (TSS) usage. We integrate the resulting isoform expression dynamics with snATAC-seq chromatin accessibility to validate TSS-driven isoform choices. LR-Split-seq provides an affordable method for identifying cluster-specific isoforms in single cells that can be further quantified with companion deep short-read scRNA-seq from the same cell populations.</p>","accessed":{"date-parts":[[2021,4,28]]},"author":[{"family":"Rebboah","given":"Elisabeth"},{"family":"Reese","given":"Fairlie"},{"family":"Williams","given":"Katherine"},{"family":"Balderrama-Gutierrez","given":"Gabriela"},{"family":"McGill","given":"Cassandra"},{"family":"Trout","given":"Diane"},{"family":"Rodriguez","given":"Isaryhia Maya"},{"family":"Liang","given":"Heidi"},{"family":"Wold","given":"Barbara J."},{"family":"Mortazavi","given":"Ali"}],"container-title":"bioRxiv","DOI":"10.1101/2021.04.26.441522","issued":{"date-parts":[[2021,4,27]]},"language":"en","page":"2021.04.26.441522","publisher":"Cold Spring Harbor Laboratory","section":"New Results","source":"www.biorxiv.org","title":"Mapping and modeling the genomic basis of differential RNA isoform expression at single-cell resolution with LR-Split-seq","type":"article-journal","URL":"https://www.biorxiv.org/content/10.1101/2021.04.26.441522v1"},
  {"id":"rezende_variational_2016","abstract":"The choice of approximate posterior distribution is one of the core problems in variational inference. Most applications of variational inference employ simple families of posterior approximations in order to allow for efficient inference, focusing on mean-field or other simple structured approximations. This restriction has a significant impact on the quality of inferences made using variational methods. We introduce a new approach for specifying flexible, arbitrarily complex and scalable approximate posterior distributions. Our approximations are distributions constructed through a normalizing flow, whereby a simple initial density is transformed into a more complex one by applying a sequence of invertible transformations until a desired level of complexity is attained. We use this view of normalizing flows to develop categories of finite and infinitesimal flows and provide a unified view of approaches for constructing rich posterior approximations. We demonstrate that the theoretical advantages of having posteriors that better match the true posterior, combined with the scalability of amortized variational approaches, provides a clear improvement in performance and applicability of variational inference.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Rezende","given":"Danilo Jimenez"},{"family":"Mohamed","given":"Shakir"}],"container-title":"arXiv:1505.05770 [cs, stat]","issued":{"date-parts":[[2016,6,14]]},"source":"arXiv.org","title":"Variational Inference with Normalizing Flows","type":"article-journal","URL":"http://arxiv.org/abs/1505.05770"},
  {"id":"sharma_keratin_2019","abstract":"Keratin 19 (K19) belongs to the keratin family of proteins, which maintains structural integrity of epithelia. In cancer, K19 is highly expressed in several types where it serves as a diagnostic marker. Despite the positive correlation between higher expression of K19 in tumor and worse patient survival, the role of K19 in breast cancer remains unclear. Therefore, we ablated K19 expression in MCF7 breast cancer cells and found that K19 was required for cell proliferation. Transcriptome analyses of KRT19 knockout cells identified defects in cell cycle progression and levels of target genes of E2F1, a key transcriptional factor for the transition into S phase. Furthermore, proper levels of cyclin dependent kinases (CDKs) and cyclins, including D-type cyclins critical for E2F1 activation, were dependent on K19 expression, and K19-cyclin D co-expression was observed in human breast cancer tissues. Importantly, K19 interacts with cyclin D3, and a loss of K19 resulted in decreased protein stability of cyclin D3 and sensitivity of cells towards CDK inhibitor-induced cell death. Overall, these findings reveal a novel function of K19 in the regulation of cell cycle program and suggest that K19 may be used to predict the efficacy of CDK inhibitors for treatments of breast cancer.","accessed":{"date-parts":[[2021,1,29]]},"author":[{"family":"Sharma","given":"Pooja"},{"family":"Alsharif","given":"Sarah"},{"family":"Bursch","given":"Karina"},{"family":"Parvathaneni","given":"Swetha"},{"family":"Anastasakis","given":"Dimitrios G."},{"family":"Chahine","given":"Joeffrey"},{"family":"Fallatah","given":"Arwa"},{"family":"Nicolas","given":"Kevin"},{"family":"Sharma","given":"Sudha"},{"family":"Hafner","given":"Markus"},{"family":"Kallakury","given":"Bhaskar"},{"family":"Chung","given":"Byung Min"}],"container-title":"Scientific Reports","DOI":"10.1038/s41598-019-51195-9","ISSN":"2045-2322","issue":"1","issued":{"date-parts":[[2019,10,10]]},"language":"en","number":"1","page":"14650","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Keratin 19 regulates cell cycle pathway and sensitivity of breast cancer cells to CDK inhibitors","type":"article-journal","URL":"https://www.nature.com/articles/s41598-019-51195-9","volume":"9"},
  {"id":"song_pseudotimede_2021","abstract":"<p>In the investigation of molecular mechanisms underlying cell state changes, a crucial analysis is to identify differentially expressed (DE) genes along a continuous cell trajectory, which can be estimated by pseudotime inference from single-cell RNA-sequencing (scRNA-seq) data. However, existing methods that identify DE genes based on inferred pseudotime do not account for the uncertainty in pseudotime inference. Also, they either have ill-posed p-values that hinder the control of false discovery rate (FDR) or have restrictive models that reduce the power of DE gene identification. To overcome these drawbacks, we propose PseudotimeDE, a robust method that accounts for the uncertainty in pseudotime inference and thus identifies DE genes along cell pseudotime with well-calibrated p-values. PseudotimeDE is flexible in allowing users to specify the pseudotime inference method and to choose the appropriate model for scRNA-seq data. Comprehensive simulations and real-data applications verify that PseudotimeDE provides well-calibrated p-values essential for controlling FDR and downstream analysis and that PseudotimeDE is more powerful than existing methods to identify DE genes.</p>","accessed":{"date-parts":[[2021,4,30]]},"author":[{"family":"Song","given":"Dongyuan"},{"family":"Li","given":"Jingyi Jessica"}],"container-title":"bioRxiv","DOI":"10.1101/2020.11.17.387779","issued":{"date-parts":[[2021,4,22]]},"language":"en","page":"2020.11.17.387779","publisher":"Cold Spring Harbor Laboratory","section":"New Results","source":"www.biorxiv.org","title":"PseudotimeDE: inference of differential gene expression along cell pseudotime with well-calibrated p-values from single-cell RNA sequencing data","title-short":"PseudotimeDE","type":"article-journal","URL":"https://www.biorxiv.org/content/10.1101/2020.11.17.387779v4"},
  {"id":"stuart_integrative_2019","abstract":"The recent maturation of single-cell RNA sequencing (scRNA-seq) technologies has coincided with transformative new methods to profile genetic, epigenetic, spatial, proteomic and lineage information in individual cells. This provides unique opportunities, alongside computational challenges, for integrative methods that can jointly learn across multiple types of data. Integrated analysis can discover relationships across cellular modalities, learn a holistic representation of the cell state, and enable the pooling of data sets produced across individuals and technologies. In this Review, we discuss the recent advances in the collection and integration of different data types at single-cell resolution with a focus on the integration of gene expression data with other types of single-cell measurement.","accessed":{"date-parts":[[2021,5,3]]},"author":[{"family":"Stuart","given":"Tim"},{"family":"Satija","given":"Rahul"}],"container-title":"Nature Reviews Genetics","DOI":"10.1038/s41576-019-0093-7","ISSN":"1471-0064","issue":"5","issued":{"date-parts":[[2019,5]]},"language":"en","number":"5","page":"257-272","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Integrative single-cell analysis","type":"article-journal","URL":"https://www.nature.com/articles/s41576-019-0093-7","volume":"20"},
  {"id":"svensson_droplet_2020","accessed":{"date-parts":[[2021,3,15]]},"author":[{"family":"Svensson","given":"Valentine"}],"container-title":"Nature Biotechnology","DOI":"10.1038/s41587-019-0379-5","ISSN":"1546-1696","issue":"2","issued":{"date-parts":[[2020,2]]},"language":"en","number":"2","page":"147-150","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Droplet scRNA-seq is not zero-inflated","type":"article-journal","URL":"https://www.nature.com/articles/s41587-019-0379-5","volume":"38"},
  {"id":"swat_probonto_2016","abstract":"Motivation: Probability distributions play a central role in mathematical and statistical modelling. The encoding, annotation and exchange of such models could be greatly simplified by a resource providing a common reference for the definition of probability distributions. Although some resources exist, no suitably detailed and complex ontology exists nor any database allowing programmatic access. Results: ProbOnto, is an ontology-based knowledge base of probability distributions, featuring more than 80 uni- and multivariate distributions with their defining functions, characteristics, relationships and re-parameterization formulas. It can be used for model annotation and facilitates the encoding of distribution-based models, related functions and quantities. Availability and Implementation:http://probonto.orgContact:mjswat@ebi.ac.ukSupplementary information:Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[[2021,4,29]]},"author":[{"family":"Swat","given":"Maciej J."},{"family":"Grenon","given":"Pierre"},{"family":"Wimalaratne","given":"Sarala"}],"container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btw170","ISSN":"1367-4803","issue":"17","issued":{"date-parts":[[2016,9,1]]},"page":"2719-2721","source":"Silverchair","title":"ProbOnto: ontology and knowledge base of probability distributions","title-short":"ProbOnto","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btw170","volume":"32"},
  {"id":"tirosh_dissecting_2016","abstract":"Single-cell expression profiles of melanoma\nTumors harbor multiple cell types that are thought to play a role in the development of resistance to drug treatments. Tirosh et al. used single-cell sequencing to investigate the distribution of these differing genetic profiles within melanomas. Many cells harbored heterogeneous genetic programs that reflected two different states of genetic expression, one of which was linked to resistance development. Following drug treatment, the resistance-linked expression state was found at a much higher level. Furthermore, the environment of the melanoma cells affected their gene expression programs.\nScience, this issue p. 189\nTo explore the distinct genotypic and phenotypic states of melanoma tumors, we applied single-cell RNA sequencing (RNA-seq) to 4645 single cells isolated from 19 patients, profiling malignant, immune, stromal, and endothelial cells. Malignant cells within the same tumor displayed transcriptional heterogeneity associated with the cell cycle, spatial context, and a drug-resistance program. In particular, all tumors harbored malignant cells from two distinct transcriptional cell states, such that tumors characterized by high levels of the MITF transcription factor also contained cells with low MITF and elevated levels of the AXL kinase. Single-cell analyses suggested distinct tumor microenvironmental patterns, including cell-to-cell interactions. Analysis of tumor-infiltrating T cells revealed exhaustion programs, their connection to T cell activation and clonal expansion, and their variability across patients. Overall, we begin to unravel the cellular ecosystem of tumors and how single-cell genomics offers insights with implications for both targeted and immune therapies.\nMelanoma cells show transcriptional heterogeneity.\nMelanoma cells show transcriptional heterogeneity.","accessed":{"date-parts":[[2021,4,29]]},"author":[{"family":"Tirosh","given":"Itay"},{"family":"Izar","given":"Benjamin"},{"family":"Prakadan","given":"Sanjay M."},{"family":"Wadsworth","given":"Marc H."},{"family":"Treacy","given":"Daniel"},{"family":"Trombetta","given":"John J."},{"family":"Rotem","given":"Asaf"},{"family":"Rodman","given":"Christopher"},{"family":"Lian","given":"Christine"},{"family":"Murphy","given":"George"},{"family":"Fallahi-Sichani","given":"Mohammad"},{"family":"Dutton-Regester","given":"Ken"},{"family":"Lin","given":"Jia-Ren"},{"family":"Cohen","given":"Ofir"},{"family":"Shah","given":"Parin"},{"family":"Lu","given":"Diana"},{"family":"Genshaft","given":"Alex S."},{"family":"Hughes","given":"Travis K."},{"family":"Ziegler","given":"Carly G. K."},{"family":"Kazer","given":"Samuel W."},{"family":"Gaillard","given":"Aleth"},{"family":"Kolb","given":"Kellie E."},{"family":"Villani","given":"Alexandra-Chloé"},{"family":"Johannessen","given":"Cory M."},{"family":"Andreev","given":"Aleksandr Y."},{"family":"Allen","given":"Eliezer M. Van"},{"family":"Bertagnolli","given":"Monica"},{"family":"Sorger","given":"Peter K."},{"family":"Sullivan","given":"Ryan J."},{"family":"Flaherty","given":"Keith T."},{"family":"Frederick","given":"Dennie T."},{"family":"Jané-Valbuena","given":"Judit"},{"family":"Yoon","given":"Charles H."},{"family":"Rozenblatt-Rosen","given":"Orit"},{"family":"Shalek","given":"Alex K."},{"family":"Regev","given":"Aviv"},{"family":"Garraway","given":"Levi A."}],"container-title":"Science","DOI":"10.1126/science.aad0501","ISSN":"0036-8075, 1095-9203","issue":"6282","issued":{"date-parts":[[2016,4,8]]},"language":"en","page":"189-196","PMID":"27124452","publisher":"American Association for the Advancement of Science","section":"Research Article","source":"science.sciencemag.org","title":"Dissecting the multicellular ecosystem of metastatic melanoma by single-cell RNA-seq","type":"article-journal","URL":"https://science.sciencemag.org/content/352/6282/189","volume":"352"},
  {"id":"tran_edward_2017","abstract":"Probabilistic modeling is a powerful approach for analyzing empirical information. We describe Edward, a library for probabilistic modeling. Edward's design reflects an iterative process pioneered by George Box: build a model of a phenomenon, make inferences about the model given data, and criticize the model's fit to the data. Edward supports a broad class of probabilistic models, efficient algorithms for inference, and many techniques for model criticism. The library builds on top of TensorFlow to support distributed training and hardware such as GPUs. Edward enables the development of complex probabilistic models and their algorithms at a massive scale.","accessed":{"date-parts":[[2021,4,29]]},"author":[{"family":"Tran","given":"Dustin"},{"family":"Kucukelbir","given":"Alp"},{"family":"Dieng","given":"Adji B."},{"family":"Rudolph","given":"Maja"},{"family":"Liang","given":"Dawen"},{"family":"Blei","given":"David M."}],"container-title":"arXiv:1610.09787 [cs, stat]","issued":{"date-parts":[[2017,1,31]]},"source":"arXiv.org","title":"Edward: A library for probabilistic modeling, inference, and criticism","title-short":"Edward","type":"article-journal","URL":"http://arxiv.org/abs/1610.09787"},
  {"id":"van_den_berge_trajectory-based_2020","abstract":"Trajectory inference has radically enhanced single-cell RNA-seq research by enabling the study of dynamic changes in gene expression. Downstream of trajectory inference, it is vital to discover genes that are (i) associated with the lineages in the trajectory, or (ii) differentially expressed between lineages, to illuminate the underlying biological processes. Current data analysis procedures, however, either fail to exploit the continuous resolution provided by trajectory inference, or fail to pinpoint the exact types of differential expression. We introduce tradeSeq, a powerful generalized additive model framework based on the negative binomial distribution that allows flexible inference of both within-lineage and between-lineage differential expression. By incorporating observation-level weights, the model additionally allows to account for zero inflation. We evaluate the method on simulated datasets and on real datasets from droplet-based and full-length protocols, and show that it yields biological insights through a clear interpretation of the data.","accessed":{"date-parts":[[2021,4,30]]},"author":[{"family":"Van den Berge","given":"Koen"},{"family":"Roux de Bézieux","given":"Hector"},{"family":"Street","given":"Kelly"},{"family":"Saelens","given":"Wouter"},{"family":"Cannoodt","given":"Robrecht"},{"family":"Saeys","given":"Yvan"},{"family":"Dudoit","given":"Sandrine"},{"family":"Clement","given":"Lieven"}],"container-title":"Nature Communications","DOI":"10.1038/s41467-020-14766-3","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[[2020,3,5]]},"language":"en","number":"1","page":"1201","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Trajectory-based differential expression analysis for single-cell sequencing data","type":"article-journal","URL":"https://www.nature.com/articles/s41467-020-14766-3","volume":"11"},
  {"id":"wagner_revealing_2016","abstract":"Computational methods for analyzing single-cell data are uncovering new ways of defining cells.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Wagner","given":"Allon"},{"family":"Regev","given":"Aviv"},{"family":"Yosef","given":"Nir"}],"container-title":"Nature Biotechnology","DOI":"10.1038/nbt.3711","ISSN":"1546-1696","issue":"11","issued":{"date-parts":[[2016,11]]},"language":"en","number":"11","page":"1145-1160","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Revealing the vectors of cellular identity with single-cell genomics","type":"article-journal","URL":"https://www.nature.com/articles/nbt.3711","volume":"34"},
  {"id":"way_bayesian_2018","abstract":"A recent approach for single-cell RNA-sequencing data uses Bayesian deep learning to correct technical artifacts and enable accurate and multifaceted downstream analyses.","accessed":{"date-parts":[[2021,4,27]]},"author":[{"family":"Way","given":"Gregory P."},{"family":"Greene","given":"Casey S."}],"container-title":"Nature Methods","DOI":"10.1038/s41592-018-0230-9","ISSN":"1548-7105","issue":"12","issued":{"date-parts":[[2018,12]]},"language":"en","number":"12","page":"1009-1010","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Bayesian deep learning for single-cell analysis","type":"article-journal","URL":"https://www.nature.com/articles/s41592-018-0230-9","volume":"15"},
  {"id":"wolf_paga_2019","abstract":"Single-cell RNA-seq quantifies biological heterogeneity across both discrete cell types and continuous cell transitions. Partition-based graph abstraction (PAGA) provides an interpretable graph-like map of the arising data manifold, based on estimating connectivity of manifold partitions (https://github.com/theislab/paga). PAGA maps preserve the global topology of data, allow analyzing data at different resolutions, and result in much higher computational efficiency of the typical exploratory data analysis workflow. We demonstrate the method by inferring structure-rich cell maps with consistent topology across four hematopoietic datasets, adult planaria and the zebrafish embryo and benchmark computational performance on one million neurons.","accessed":{"date-parts":[[2021,4,20]]},"author":[{"family":"Wolf","given":"F. Alexander"},{"family":"Hamey","given":"Fiona K."},{"family":"Plass","given":"Mireya"},{"family":"Solana","given":"Jordi"},{"family":"Dahlin","given":"Joakim S."},{"family":"Göttgens","given":"Berthold"},{"family":"Rajewsky","given":"Nikolaus"},{"family":"Simon","given":"Lukas"},{"family":"Theis","given":"Fabian J."}],"container-title":"Genome Biology","container-title-short":"Genome Biology","DOI":"10.1186/s13059-019-1663-x","ISSN":"1474-760X","issue":"1","issued":{"date-parts":[[2019,3,19]]},"page":"59","source":"BioMed Central","title":"PAGA: graph abstraction reconciles clustering with trajectory inference through a topology preserving map of single cells","title-short":"PAGA","type":"article-journal","URL":"https://doi.org/10.1186/s13059-019-1663-x","volume":"20"},
  {"id":"zhao_clonal_2021","abstract":"Hyperinflammation contributes to lung injury and subsequent acute respiratory distress syndrome (ARDS) with high mortality in patients with severe coronavirus disease 2019 (COVID-19). To understand the underlying mechanisms involved in lung pathology, we investigated the role of the lung-specific immune response. We profiled immune cells in bronchoalveolar lavage fluid and blood collected from COVID-19 patients with severe disease and bacterial pneumonia patients not associated with viral infection. By tracking T cell clones across tissues, we identified clonally expanded tissue-resident memory-like Th17 cells (Trm17 cells) in the lungs even after viral clearance. These Trm17 cells were characterized by a a potentially pathogenic cytokine expression profile of IL17A and CSF2 (GM-CSF). Interactome analysis suggests that Trm17 cells can interact with lung macrophages and cytotoxic CD8+ T cells, which have been associated with disease severity and lung damage. High IL-17A and GM-CSF protein levels in the serum of COVID-19 patients were associated with a more severe clinical course. Collectively, our study suggests that pulmonary Trm17 cells are one potential orchestrator of the hyperinflammation in severe COVID-19.","author":[{"family":"Zhao","given":"Yu"},{"family":"Kilian","given":"Christoph"},{"family":"Turner","given":"Jan-Eric"},{"family":"Bosurgi","given":"Lidia"},{"family":"Roedl","given":"Kevin"},{"family":"Bartsch","given":"Patricia"},{"family":"Gnirck","given":"Ann-Christin"},{"family":"Cortesi","given":"Filippo"},{"family":"Schultheiß","given":"Christoph"},{"family":"Hellmig","given":"Malte"},{"family":"Enk","given":"Leon U. B."},{"family":"Hausmann","given":"Fabian"},{"family":"Borchers","given":"Alina"},{"family":"Wong","given":"Milagros N."},{"family":"Paust","given":"Hans-Joachim"},{"family":"Siracusa","given":"Francesco"},{"family":"Scheibel","given":"Nicola"},{"family":"Herrmann","given":"Marissa"},{"family":"Rosati","given":"Elisa"},{"family":"Bacher","given":"Petra"},{"family":"Kylies","given":"Dominik"},{"family":"Jarczak","given":"Dominik"},{"family":"Lütgehetmann","given":"Marc"},{"family":"Pfefferle","given":"Susanne"},{"family":"Steurer","given":"Stefan"},{"family":"Zur-Wiesch","given":"Julian Schulze"},{"family":"Puelles","given":"Victor G."},{"family":"Sperhake","given":"Jan-Peter"},{"family":"Addo","given":"Marylyn M."},{"family":"Lohse","given":"Ansgar W."},{"family":"Binder","given":"Mascha"},{"family":"Huber","given":"Samuel"},{"family":"Huber","given":"Tobias B."},{"family":"Kluge","given":"Stefan"},{"family":"Bonn","given":"Stefan"},{"family":"Panzer","given":"Ulf"},{"family":"Gagliani","given":"Nicola"},{"family":"Krebs","given":"Christian F."}],"container-title":"Science Immunology","container-title-short":"Sci Immunol","DOI":"10.1126/sciimmunol.abf6692","ISSN":"2470-9468","issue":"56","issued":{"date-parts":[[2021,2,23]]},"language":"eng","PMID":"33622974","source":"PubMed","title":"Clonal expansion and activation of tissue-resident memory-like Th17 cells expressing GM-CSF in the lungs of severe COVID-19 patients","type":"article-journal","volume":"6"}
]
